#include<stdio.h>
//**********************************************************
//现有一个数字闹钟（时间采用24时制）。
// 已知当前时间和预订的闹钟时间（全部为整点时间），请你帮忙计算，几小时后闹钟会响。 
// 输入说明：每个输入有ct和tt，ct是当前时间，tt是预定的闹铃时间。 
// 输出说明：距离闹钟响起的时间。 输入样例：22 5 输出样例：7
//int main()
//{
//	int ct,tt;
//	scanf_s("%d %d", &ct, &tt);
//	int x=0;
//	if (ct > tt)
//		x = 24 - ct + tt;
//	else
//		x = tt - ct;
//	printf("%d", x);
//	return 0;
//}

//**********************************************************
//输入一个正整数N(1 <= N < 10000), 
// 接下来输入这N个正整数序列，
// 再输入一个正整数K(1 <= K <= 100), 
// 其后跟K行操作，每行操作包括两个正整数i和j(1 <= i <= j <= N)，
// 表示将区间[i, j]中的元素删除，操作结束后输出最终的正整数序列。 
// 输入： 第一行输入N 第二行输入N个正整数 第三行输入K。 其后K行每行输入两个正整数
// 输出： 输出操作结束后的最终序列，相邻两数之间以一个空格分隔。 
// 样例输入： 10 
// 1 2 3 4 5 6 7 8 9 10 
// 2 
// 1 3 8 10 
// 样例输出： 4 5 6 7
//int main()
//{
//	int x[10000];
//	int a[2];
//	int b[2];
//	int N;
//	scanf_s("%d", &N);
//	int tem = N;
//	int i = 0;
//	for (i = 0; i < N; i++)
//	{
//		scanf_s("%d", &x[i]);
//	}
//	int K;
//	scanf_s("%d", &K);
//	for (i = 0; i < K; i++)
//		scanf_s("%d %d", &a[i],&b[i]);
//	for (i = 0; i < K; i++)
//	{
//		int j = 0;
//		for (j = 0; j < N; j++)
//		{
//			if (a[i] <= x[j]&&x[j] <= b[i])
//			{
//				x[j] = NULL;
//				tem--;
//			}
//		}
//	}
//	for (i = 0; i < N; i++)
//	{
//		if (x[i] != 0)
//			printf("%d ", x[i]);
//	}
//	return 0;
//}



//int main() {
//    int num1;
//    char str1[100];
//    printf("请输入一个整数（字符串形式）：");
//    fgets(str1, sizeof(str1), stdin); // 从标准输入读取字符串
//    num1 = atoi(str1); // 将字符串转换为整数
//    printf("转换后的整数是：%d\n", num1);
//
//    int num2;
//    char str2[100]; // 用于存储转换后的字符串
//    printf("请输入一个整数：");
//    scanf_s("%d", &num2); // 输入整数
//    // 使用 sprintf 将整数转换为字符串
//    snprintf(str2, sizeof(str2), "%d", num2);
//    // 输出结果
//    printf("转换后的字符串是：%s\n", str2);
//
//    return 0;
//}

//**********************************************************
//写个一个程序统计从1到N这N个数中，以下三个条件都满足的数字x个数 
// 1. x是一个素数（如2,3,5,7....) 
// 2. x是一个对称的数 (如1,11,121,都是对称的数) 
// 3. x的所有数字和恰好是7的倍数(如7,16,25,34,43,61,70,115,) 
// 输入：一个整数N(1<=N<=10000) 
// 输出: 满足这三个条件的个数 
// 样例输入: 20 
// 样例输出 1 
// 样例解释： 从1~20中素数有2,3,5,7,11,13,17,19，再结合条件2可以看到对称的数只有 2 3 5 7 11，又因

#include<string.h>
int print1(int N)//将整数转换为字符，判断字符串的长度来读取整数的位数
{
	char str[10000];
	snprintf(str,sizeof(str), "%d", N);
	int l = strlen(str);
	return l;
}
int main()
{
	int x;
	int i=0;
	int N[10000] = { 0 };
	scanf_s("%d", &x);
	int s = 2;
	for (i = 0; i < x-1; i++)
	{
		N[i] = s;
		s++;
	}
	//判断是否为素数
	for (i = 1; i < x; i++)
	{
		int j =2;
		for (j = 2; j < N[i]; j++)
		{
			if (N[i] % j == 0)
			{
				N[i] = 0;
			}
		}
	}
	for (i = 0; i < x; i++)
	{
		if (N[i] == 0)
			continue;
		int s1 = 0;
		int s2 = 0;
		int s3 = 0;
		int s4 = 0;
		int l=print1(N[i]);
		if (l == 1)
		{
			s1 = N[i] % 10;
			if (s1 % 7 != 0)
				N[i] = 0;
		}
		else if (l == 2)
		{
			s1 = N[i] % 10;
			s2 = (N[i] - s1) % 10;
			if (s1 != s2||(s1+s2)%7!=0)
				N[i] = 0;
		}
		else if (l == 3)
		{
			s1 = N[i] % 10;
			s2 = (N[i] - s1) % 10;
			s3 = (N[i] - s2 * 10 - s1) % 10;
			if (s1 != s3|| (s1 + s2+ s3) % 7 != 0)
				N[i] = 0;
		}
		else if (l == 4)
		{
			s1 = N[i] % 10;
			s2 = (N[i] - s1) % 10;
			s3 = (N[i] - s2 * 10 - s1) % 10;
			s4 = (N[i] - s3 * 100 - s2 * 10 - s1) % 10;
			if (s1 != s4 || s2 != s3 || (s1 + s2 + s3+ s4) % 7 != 0)
				N[i] = 0;
		}
	}
	int count = 0;
	for (i = 0; i < x; i++)
	{
		if (N[i] != 0)
			count++;
	}
	printf("%d", count);
	return 0;
}